In [397]:
import pandas as pd
import seaborn as sns

In [398]:
tips=sns.load_dataset("tips")

In [349]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [350]:
tips['sm_str']=tips['smoker'].astype(str)
tips.dtypes

TypeError: data type "hello
hi
how are you
fine
" not understood

In [351]:
tips_miss=tips.head(10)

In [352]:
tips_miss.loc[[1, 3, 5, 7], 'total_bill']='missing'

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:965: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [353]:
tips_miss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  10 non-null     object
 1   tip         10 non-null     float64
 2   sex         10 non-null     category
 3   smoker      10 non-null     category
 4   day         10 non-null     category
 5   time        10 non-null     category
 6   size        10 non-null     int64
dtypes: category(4), float64(1), int64(1), object(1)
memory usage: 888.0+ bytes

In [354]:
tips_miss['total_bill'].astype('float')

ValueError: could not convert string to float: 'missing'

In [355]:
tips_miss['total_bill']=pd.to_numeric(tips_miss['total_bill'], errors='ignore')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [356]:
tips_miss.dtype

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [357]:
tips_miss['total_bill']=pd.to_numeric(tips_miss['total_bill'], errors='coerce')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [358]:
tips_miss

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1         NaN  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3         NaN  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5         NaN  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7         NaN  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [359]:
tips.info()
#smoker 타입을 str로 변경

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [360]:
tips['smoker']=tips['smoker'].astype('category')

In [361]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [362]:
word="hello"
sent="world"
word[0]
word[1:4]
sent[-3]
sent[0:-1]
word[:4]
sent[2:len(sent)]
sent[::2]

'wrd'

In [363]:
nation1='대'
nation2='한'
nation3='민'
nation4='국'

In [364]:
"".join([nation1,nation2,nation3,nation4])

'대한민국'

In [365]:
mystr="""hello
hi
how are you
fine
"""

In [366]:
ms=mystr.splitlines()
ms=ms[::2]
ms

['hello', 'how are you']

In [367]:
#문자열 변경 

ms[0].replace("hello", "hihello")

'hihello'

In [368]:
ex="hi hello bye goodbye"
ex.replace("hi", "hihello")

'hihello hello bye goodbye'

In [369]:
a="hello"
b="{} world"
b.format(a)

'hello world'

In [370]:
print("pi : {}".format(3.14))
print("my id number is : {0:05d}".format(25))
#05d = 0을 5개 채워라

pi : 3.14
my id number is : 00025

In [371]:
import re

In [372]:
tel="01012345678"
m=re.match(pattern="|d|d|d|d|d|d|d|d|d|d|d", string=tel)

if m:
    print("매치가 됐어요")
else:
    print("매치가 되지 않았어요")

매치가 됐어요

In [373]:
m.start()
m.end()
m.span()
m.group()

''

In [374]:
tel="01012345678"
m=re.match(pattern="\d{11}", string=tel)

if m:
    print("매치가 됐어요")
    print(m.span())
else:
    print("매치가 되지 않았어요")

매치가 됐어요
(0, 11)

In [375]:
tel="010 123 4567"
tel2="(123) 456-7890"
p= "\(\d{3}\)\s?\d{3}-\d{4}"

#p="\d{3}\s?\d{3}\s?\d{4}"

#\s:공백, \t,\n\re
#\?: 있어도 없어도 됨
#\ex) \s?: 공백 문자가 있어도 되고, 없어도 됨


m=re.match(pattern=p, string=tel2)
print(m)

<re.Match object; span=(0, 14), match='(123) 456-7890'>

In [376]:
# 이메일 주소 패턴식
"""

가능한 패턴
test@abc.com, test2@abc.com. jy.kim@google.com
test@abc.co.kr

불가능한 패턴
2test@abc.com, kim.google.com, test@abc

"""
p="[a-zA-Z]+[a-zA-Z.0-9]+@[a-z]+.[a-z]+.[a-z]+"
addr="test@abc.com"

In [377]:
a=re.match(pattern=p, string=addr)

In [378]:
print(a)

<re.Match object; span=(0, 12), match='test@abc.com'>

In [379]:
def mysq(x):
    return x**2
def mysq2(x,n):
    return x**n

In [380]:
print(mysq(3))
print(mysq2(4,3))

9
64

In [381]:
import pandas as pd

In [382]:
df=pd.DataFrame({
    'a':[10, 20, 30],
    'b':[20, 30, 40]
})

In [383]:
df
# df의 a열에 저장된 값의 제곱값을 출력하시오

    a   b
0  10  20
1  20  30
2  30  40

In [384]:
mysq(df['a'])

0    100
1    400
2    900
Name: a, dtype: int64

In [385]:
df['a'].apply(mysq)

0    100
1    400
2    900
Name: a, dtype: int64

In [386]:
df['a'].apply(mysq2, n=2)

0    100
1    400
2    900
Name: a, dtype: int64

In [387]:
#df
def myprint(x):
    print(x)

In [388]:
df.apply(myprint, axis=0) 

#axix=0 defqult 열 단위 출력
#axis=1 행 단위 출력

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [389]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [390]:
def myavg(x):
    return(x[0]+x[1]+x[2])/3
#구현 부분
print(df.apply(myavg))

a    20.0
b    30.0
dtype: float64

In [391]:
def avg2(row):
    sum=0
    for i in row:
        sum+=i #sum=sum+i
    
    return sum/df.shape[1]

In [394]:
print(df.apply(avg2, axis=1))

0    15.0
1    25.0
2    35.0
dtype: float64

In [404]:
titanic=sns.load_dataset("titanic")
titanic.info()
titanic.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [407]:
# iris=sns.load_dataset("iris")
# iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [416]:
#결측치 계산하는 법

import numpy as np
#np.sum(pd.isnull(titanic))
#np.sum 함수는 열 단위로 True의 개수를 count
#스칼라? 크기만 나타낸 것 
#vector? 크기와 방향을 나타낸 것

"""
주스 장사 (매출장부)
어제: 사과주스 5개 판매, 포도주스 2개 판매, 바나나 주스 3개 판매 
오늘: 바나나 주스 20개 판매, 포도주스 1개 판매, 사과주스 0개 판매  
* 기재할때 순서가 있으면 좋은 것 같은데? -> 방향 필요
      사과주스 0개 판매, 포도주스 1개 판매, 바나나 주스 20개 판매
=>
    사과, 포도, 바나나
어제: (5, 2, 3)  => 어제의 행 벡터 (ex. 5: Vector의 성분)
오늘: (0, 1, 20) => 오늘의 행 벡터 
*3차원임
     사과 열벡터 (5,0) => 열벡터 (요일단위로 바뀜)

얼굴인식-> 홍길동인지 아닌지 = sig(x1*w1 + x2*w2...x10000*w10000+b) > 0.5 => 1
고차원 => 연산량 => 고차원 => 저차원 
...

"""

def countmissing(vec):
    #vec[0] ~ [891]
    nullvec=pd.isnull(vec)
    nullcnt=np.sum(nullvec) #sum:True 총합
    return nullcnt

print(titanic.apply(countmissing))

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [419]:
def propmissing(vec):
    num=countmissing(vec)
    #print(vec.size)
    return(num/vec.size)
    
print(titanic.apply(propmissing))

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [421]:
def propcomplete(vec):
    return 1-propmissing(vec)

In [434]:
cr=titanic.apply(countmissing, axis=1)
#cr
pr=titanic.apply(propmissing, axis=1)
#print(pr)
pc=titanic.apply(propcomplete, axis=1)
pc

0      0.933333
1      1.000000
2      0.933333
3      1.000000
4      0.933333
         ...
886    0.933333
887    1.000000
888    0.866667
889    1.000000
890    0.933333
Length: 891, dtype: float64

In [440]:
titanic['nummissing']=titanic.apply(countmissing, axis=1)

In [441]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,nummissing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2

In [445]:
titanic.loc[titanic['nummissing'] > 1,:]
#nummissing 이 1보다 큰 행 전체 추출

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,nummissing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,3
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,2
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,2
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2

In [1]:
f=open("BEXX0003.txt", "r", encoding='utf-16')
lines=f.readline()
print(lines)
while True:
    line=f.readline()
    if not line:
        break

<!DOCTYPE tei.2 SYSTEM "c:\sgml\dtd\tei2.dtd" [